app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "altered_line_items" ("id","product_id","cart_id","created_at","updated_at","quantity") VALUES (41, 5, 38, '2013-04-11 05:07:43.217936', '2013-04-11 05:07:43.217936', 1)
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 09 Apr 2013 08:39:30 UTC +00:00], ["updated_at", Tue, 09 Apr 2013 08:39:30 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 126], ["created_at", Fri, 12 Apr 2013 00:30:26 UTC +00:00], ["order_id", nil], ["product_id", 8], ["quantity", 1], ["updated_at", Fri, 12 Apr 2013 00:30:26 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-04-11 05:28:13.575670' WHERE "line_items"."id" = 41
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save