app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "users" SET "name" = 'sam', "password_digest" = '$2a$10$ySrAFjndWqppQEMVXXq5yeDLDGfKa00d6plQvgI1GeR3CPYgJ.9Ze', "updated_at" = '2013-04-15 01:27:16.515458' WHERE "users"."id" = 980190962
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy